<b>La guía aquí expuesta se basa en el documento original de <a href="https://www.gamefaqs.com/arcade/575673-the-ocean-hunter/faqs/20715">Thanos6, 2002.</a></b><br /><br />

<p>THE OCEAN HUNTER: THE SEVEN SEAS ADVENTURE<br />
The Boss/Mythology FAQ</p>

<p>TABLE OF CONTENTS</p>

<ol>
<li>Why This Guide?</li>
<li>Layout</li>
<li>Glossary</li>
<li>Boss Strategies</li>
<li>Mythological/Religious Guide</li>
<li>What's To Come</li>
<li>Reader Submitted Information And Tips</li>
<li>Recognition</p>
</ol>

<p>WHY THIS GUIDE?</p>

<p>If anyone's reading this, you're probably wondering, &quot;Why make a boss FAQ for<br />
this game?&quot; I'll tell you why. Because the bosses in this game can be quite<br />
difficult, and they're good at removing quarters from your pocket. Besides,<br />
it's a fun game that deserves to have at least one FAQ about it.</p>

<p>***</p>

<p>LAYOUT</p>

<p>The format for each boss guide will be structured like this.</p>

<p>Nombre: The boss's Nombre.<br />
Descripci&oacute;n: What the boss looks like.<br />
Criaturas aliadas: Any other creatures that may try and attack you while<br />
fighting.<br />
Te lo encuentras: How to tell when you're approaching the boss.<br />
Dificultad: How hard the boss is to defeat, on a scale of Uno to ten, ten<br />
being the hardest.<br />
Estrategia: How to defeat the boss.</p>

<p>***</p>

<p>GLOSSARY</p>

<p>A quick rundown on some terms I'll be using throughout this guide.</p>

<p>Sunburst Area: There are certain areas on muchas bosses that will produce more<br />
damage if hit. You can find these areas by looking for the large golden<br />
flash that they give off when struck. I call these areas the Sunburst Areas.<br />
Often, a boss will halt his or her attack if they are hit in this region.</p>

<p>Sweet Spots: About halfway through the battle with each of the major bosses<br />
(with a couple of exceptions), circles will form around certain parts of<br />
their body that you must hit. Tres hits to the circles will defeat the<br />
boss. These are the Sweet Spots.</p>

<p>Sea Monster: According to a promotional brochure, the seven main bosses are<br />
known as 'Sea Monsters.' Henceforth, in this FAQ Sea Monster refers to Uno<br />
of those.</p>

<p>***</p>

<p>Estrategias para los jefes</p>

<p>Stage Uno: Baroque Sea<br />
-------------------------------------------</p>

<p>Nombre: White Death<br />
Descripci&oacute;n: Un tibur&oacute;n blanco m&aacute;s grande de lo normal.<br />
Criaturas aliadas: Ninguna.<br />
Te lo encuentras: Despu&eacute;s de matar una docena de tiburUnos y o&iacute;r a un buceador gritar &quot;My god!&quot;<br />
Dificultad: 2.<br />
Estrategia: La &uacute;nica raz&oacute;n para que White Death merezca un dos en dificultad es por el buzo<br />
que est&aacute; cazando. Si le detienes, el buceador te dar&aacute; una vida tras la batalla. Para hacerle parar de cazar al humano indefenso, apunta y dispara repetidamente alrededor de la base de su cabeza, en la uni&oacute;n de sus mand&iacute;bulas. Esa es su sunburst area. Si le consigues alcanzar varias veces, dejar&aacute; al buzo e ir&aacute; a por t&iacute;. Ahora tendr&aacute;s que dispararle preferentemente en su sunburst area, y deber&iacute;a durar poco.</p>

<p>Nombre: Sea Dragon<br />
Descripci&oacute;n: Un enorme largarto, quiz&aacute; un drag&oacute;n de Komodo o una iguana marina.<br />
Criaturas aliadas: Ninguna.<br />
Te lo encuentras: Despu&eacute;s de vencer a las serpientes naranjas de las cuevas con cofres del tesoro ser&aacute;s golpeado (sin perder vida) y dir&aacute;s &quot;Ow!&quot;. Creo que esto depende de si salvaste al buzo antes o no.<br />
Dificultad: Uno.<br />
Estrategia: Este es muy sencillo. Si le puedes apuntar, le puedes dar, y si le puedes dar, le puedes vencer. S&iacute;mplemente enca&ntilde;&oacute;nalo y disp&aacute;rale, es muy dif&iacute;cil que Sea Dragon te quite vida. Sigue disparando y caer&aacute;. Su sunburst area est&aacute; en su cabeza.</p>

<p>Nombre: Sea Serpent<br />
Descripci&oacute;n: Una larga serpiente a rayas blancas y negras.<br />
Criaturas aliadas: Ninguna.<br />
Te lo encuentras: Bajando las escaleras del barco, te das cuenta de que &quot;There's something behind me!&quot;<br />
Dificultad: Uno.<br />
Estrategia: Incluso m&aacute;s f&aacute;cil. Sea Serpent tiene su subburst area en su enorme boca abierta, con la cual intenta atacarte. Sigue apretando los botones de disparo y sigue dispar&aacute;ndole a la cabeza. Tarde o temprano abrir&aacute; su boca, y casi inmediatamente le dar&aacute;s en las mand&iacute;bulas. ten segundos despu&eacute;s la vencer&aacute;s.</p>

<p>EL PRIMER MONSTRUO MARINO<br />
Nombre: Kraken<br />
Descripci&oacute;n: Un enorme pulpo bien posicionado.<br />
Criaturas aliadas: Ninguna.<br />
Te lo encuentras: Al entrar a una sala del barco donde hay solo un tibur&oacute;n y dos barracuras.<br />
Dificultad: Cuatro.<br />
Estrategia: De acuerdo, el primero de los monstruos marinos y tu primer desaf&iacute;o real. Kraken te intentar&aacute; atacar con sus tent&aacute;culos. Siempre que alce un tent&aacute;culo, disp&aacute;rale sin parar. Mientras disparas, sigue el tent&aacute;culo hasta el final, de modo que llegar&aacute; un momento en el cual le est&eacute;s disparando en el final del tent&aacute;culo (una sunburst area) hasta que lo retire. Seguir&aacute; intentando atacarte con sus distintos tent&aacute;culos. Repite el proceso con varios tent&aacute;culos hasta que le hayas quitado la mitad de la salud. Cuando esto ocurra, Kraken te atrapar&aacute; en uno de sus tent&aacute;culos. Es el momento del sweet spot.</p>

<p>El sweet spot aqu&iacute; est&aacute; en su ojo. Es relativamente f&aacute;cil darle, y sabr&aacute;s que lo has hecho cuando su ojo brille con luz dorada. Si no le das en el ojo y pasa determinado tiempo, perder&aacute;s un punto de da&ntilde;o, pero darle en el ojo resetea la cuenta atr&aacute;s. Si le das en el ojo tres veces, te has pasado el Baroque Sea.</p>

<p>Stage Dos: Luna Sea<br />
-------------------------------------------</p>

<p>Nombre: Hydra<br />
Descripci&oacute;n: Tres morenas saliendo de sus cuevas. Si son tres morens separadas, o una sola criatura con tres cabezas, est&aacute; m&aacute;s all&aacute; de nuestro conocimiento actual.<br />
Criaturas aliadas: Ninguna.<br />
Te lo encuentras: Despu&eacute;s de que un buzo hable de un monstruo detr&aacute;s de &eacute;l.<br />
Dificultad: Tres.<br />
Estrategia: Cuando te las encuentras por primera vez en sus cuevas, pasando r&aacute;pidamente de una cueva a otra, puedes dispararles pero no les har&aacute;s da&ntilde;o. Aprovecha ese momento para golpear los cofres del tesoro, despu&eacute;s no podr&aacute;s. Cuando hayas visto a las tres morenas, empezar&aacute;s a rotar entre ellas, de la 1 a la 2, de la 2 a la 3, de la 3 a la 1, etc. Esta pelea requiere una punter&iacute;a decente. Necesitar&aacute;s golpear a la(s) Hydra(s) en sus bocas repetidas veces para evitar que te muerdan, y sus bocas son tambi&eacute;n sus sunburst areas. Despu&eacute;s de hacer la rotaci&oacute;n varias veces, deber&iacute;as vencerlas a todas, pero algunas podr&iacute;an aguantar m&aacute;s que otras.</p>

<p>THE SECOND SEA MONSTER<br />
Nombre: Leviathan<br />
Descripci&oacute;n: Un gran, gran tibur&oacute;n del tama&ntilde;o de una ballena con un grueso blindaje.<br />
Criaturas aliadas: Tiburones.<br />
Te lo encuentras: No mucho despu&eacute;s de salvar al buzo en las ruinas.<br />
Dificultad: Cinco.<br />
Estrategia: Cuando se trata de Leviathan, el segundo de los monstruos marinos, la regla n&uacute;mero 1 es no apartar tus dedos del gatillo. &Eacute;l tiene m&aacute;s armadura que el the Monitor and the Merrimac juntos, y t&uacute; vas a tener que dispararle much&iacute;simas veces para hacer da&ntilde;o tangible.</p>

<p>Leviathan empezar&aacute; rode&aacute;ndote lentamente. Este es un periodo donde le puedes disparar lo que quieras, no se vengar&aacute; por ello. En un momento dado, empezar&aacute; a nadar hacia t&iacute;a, pero un par de tiros buenos en su sunburst area en su mand&iacute;bula inferior le persuadir&aacute;n a retirarse. Si se acerca demasiado, tendr&aacute;s que dispararle dentro de la boca. R&aacute;pidamente volver&aacute; a su patr&oacute;n de rodearte circularmente, pero esta vez mandar&aacute; tres tiburones a atacarte. Cuando los hayas matado, sigue dispar&aacute;ndole. &Eacute;l pronto te enviar&aacute; m&aacute;s tiburones. Esto se repetir&aacute; un par de veces. Una vez que &eacute;l env&iacute;a a los tiburones que te hacen cambiar de direcci&oacute;n para matarles, &eacute;l se habr&aacute; ido cuando vuelves a mirar a donde estaba. Te quedar&aacute;s patidifuso un momento, y luego irrumpir&aacute; de las ruinas yendo directo hacia t&iacute;. Es momento de sweet spot.</p>

<p>El sweet spot de Leviathan est&aacute; en su garganta. Cuando se acerque, castiga su es&oacute;fago y deber&iacute;as darle sin mucha dificultad. Tres disparos y podr&aacute;s ver la bonita escena en que Leviathan muere. Felicidades, has conquistado el Luna Sea.</p>

<p>Stage Tres: Tartarus Deep<br />
-------------------------------------------</p>

<p>Nombre: Scylla<br />
Descripci&oacute;n: Un enorme calamar de color p&uacute;rpura brillante.<br />
Criaturas aliadas: Ninguna.<br />
Te lo encuentras: Cuando un buzo te dice &quot;a monster back there.&quot;<br />
Dificultad: Cinco.<br />
Estrategia: </p>

<p>Scylla tiene dos fases de combate. La primera y m&aacute;s larga es una versi&oacute;n algo m&aacute;s dura de la batalla con Kraken, donde le tienes que disparar al tent&aacute;culo que est&aacute; levantando para hacerte da&ntilde;o. Despu&eacute;s de quitarle la mayor&iacute;a de su vida, ella se retirar&aacute; a un lugar muy lejano para cargar contra t&iacute;. Tienes mucho tiempo para dispararle, pero a consecuencia de su cabeza de calamar con extra&ntilde;a forma, es muy dif&iacute;cil de hacer hasta que ella est&aacute; casi encima de t&iacute;, y a&uacute;n no he sido capaz de matarla en la primera carga, siempre me da. En la siguiente carga, en cambio, deber&iacute;as ser capaz de matar a Scylla y seguir.</p>

<p>Nombre: Naga<br />
Descripci&oacute;n: Un pez remo monstruosamente largo.<br />
Criaturas aliadas: Ninguna.<br />
Te lo encuentras: Despu&eacute;s de haberte cargado un mont&oacute;n de esas cosas verdes y moradas que parecen serpientes de mar. Parece que no son un landmark concreto y la batalla llega un poco de sorpresa.<br />
Dificultad: Dos.<br />
Estrategia: La pantalla dice &quot;Shoot shoot shoot!&quot; y no hay mejor manera de describirlo. A pesar de que sea un poco complicado dada su relativa delgadez, disp&aacute;rale sin parar. Su sunburst area, creo, es donde uno de sus 'bigotes' se conecta con su barbilla. Dispar&aacute;ndole te aseguras de que no te golpee, y pronto podr&aacute;s seguir tu camino.</p>

<p>THE THIRD SEA MONSTER<br />
Nombre: Charybdis<br />
Descripci&oacute;n: Un pez linterna bastante grande.<br />
Criaturas aliadas: Esas extra&ntilde;as cosas verdes y moradas (serpientes marinas?)<br />
Te lo encuentras: Cuando llevas un rato en la zona totalmente oscura del nivel.<br />
Dificultad: Seven.<br />
Estrategia: Charybdis, el tercero de los monstruos marinos, es un completo nuevo nivel de problema e irritaci&oacute;n. Aseg&uacute;rate de tener un par de euros extra porque si no has muerto a&uacute;n, casi seguro que lo har&aacute;s aqu&iacute;. La batalla con Charybdis tiene varias partes distintas. En la primera, ella nadar&aacute; delante de t&iacute;, ocasionalmente parando para abrir su boca y liberar algunas cosas-serpiente marinas que debes matar. Es ocasionalmente, pero no siempre, posible detenerla de hacer eso dispar&aacute;ndole repetidamente en su mand&iacute;bula inferior. Esta es su sunburst area.</p>

<p>Poco despu&eacute;s, se retirar&aacute; al final de la cueva, y todo lo que podr&aacute;s ver de ella es su linterna. Apunta y dispara bajo la linterna para golpearla, sabr&aacute;s que est&aacute;s haci&eacute;ndolo bien si ves peque&ntilde;os flashes dorados. Si no le disparas lo suficiente, saldr&aacute; de la oscuridad y te morder&aacute;. Cuando le hayas dado varias veces, volver&aacute; hacia t&iacute;. Es hora del desaf&iacute;o sweet spot.</p>

<p>Como una aspiradora gigante, Charybdis intentar&aacute; aspirarte dentro de su boca. T&uacute; tienes que dispararle a su linterna para imped&iacute;rselo. Esto es bastante dif&iacute;cil, porque t&uacute; siempre te est&aacute;s moviendo, y la linterna tambi&eacute;n. Simplemente apunta en la direcci&oacute;n en la que crees que va, y ten fe. Tres impactos en la linterna y su muerte alumbrar&aacute; la cueva. Has acabado en Tartarus Deep.</p>

<p>Stage Cuatro: Texcoco Great Lake<br />
-------------------------------------------</p>

<p>THE FOURTH SEA MONSTER<br />
Nombre: Ahuizotl<br />
Descripci&oacute;n: Un Elasmosaurio gigante, una criatura prehist&oacute;rica que recuerda al Plesiosaurio o a la concepci&oacute;n popular del monstruo del lago Ness.<br />
Criaturas aliadas: Ninguna.<br />
Te lo encuentras: Has vencido un mont&oacute;n de pejelagartos en las ruinas hundidas y llegas a la puerta del templo.<br />
Dificultad: Seis.<br />
Estrategia: Ahuizotl, el cuarto de los monstruos marinos, es el &uacute;nico jefe de la fase entera. Eso es una suerte, porque a pesar de que es un poco m&aacute;s f&aacute;cil que Charybdis, no le puede tomar en broma. Despu&eacute;s de que emerga del templo, intentar&aacute; devorarte. Para hacerlo, levantar&aacute; su cabeza sobre su largo cuello y atacar&aacute; a gran velocidad. Tienes que ser muy r&aacute;pido tanto apuntando como disparando. Debes dispararle en su cabeza, su sunburst area, y le tienes que dar casi todas las veces, o si no te quitar&aacute; vida. Cuando la mitad de la barra de vida de Ahuizotl haya sido eliminada, nadar&aacute;s hacia la superficie y te pondr&aacute;s de pie en tierra, donde apuntar&aacute;s a su sweet spot.</p>

<p>Esta parte es f&aacute;cil. Ahuizotl levantar&aacute; su cabeza para atacarte, igual que bajo el agua.<br />
Afortunadamente para &eacute;l, sus mand&iacute;bulas son su sweet spot. Basta con hacer estallar una bala en su hocico. &Eacute;l se retirar&aacute; a debajo del agua por uns instantes. D&aacute;ndote tiempo para darle al cofre del tesoro m&aacute;s cercano unas pocas veces. Luego regresar&aacute;. Disp&aacute;rale de nuevo y bucear&aacute; otra vez. Tras dar un par de disparos al cofre del tesoro, un disparo m&aacute;s en sus mand&iacute;bulas y su vida habr&aacute; acabado. Has concluida tu breve viaje a Texcoco Great Lake.</p>

<p>
Stage Cinco: North Sea<br />
-------------------------------------------</p>

<p>Nombre: Medusa<br />
Descripci&oacute;n: Una medusa gigante.<br />
Criaturas aliadas: Cientos de medusas m&aacute;s peque&ntilde;as.<br />
Te lo encuentras: Cuando te est&aacute;s abriendo camino entre las medusas.<br />
Dificultad: Cuatro.<br />
Estrategia: </p>

<p>Es hora de que te enfrentes a Medusa, la reina gigante de las medusas.<br />
El peligro principal no es ella sino su progenie. Las peque&ntilde;as medusas pulular&aacute;n por la pantalla, bloqueando tus disparos hacia Medusa y atac&aacute;ndote. Intenta limpiar un punto alrededor de medusa para que le pudas disparar bien, pero aseg&uacute;rate de matar a toda medusa peque&ntilde;a que te intenta atacar.</p>

<p>Despu&eacute;s de un tiempo, Medura empezar&aacute; a cargarte. Cuando lo haga, dale en la cabeza, o donde su cabeza conecta con sus tent&aacute;culos; esa es su sunburst area, y d&aacute;ndole ah&iacute; te prevendr&aacute; de recibir da&ntilde;o. Contin&uacute;a este patr&oacute;n hasta que Medusa sea vencida.</p>

<p>THE FIFTH SEA MONSTER<br />
Nombre: Karkinos<br />
Descripci&oacute;n: El mayor cangrejo que jam&aacute;s ver&aacute;s.<br />
Criaturas aliadas: Ninguna.<br />
Te lo encuentras: Inmediatamente despu&eacute;s de vencer a Medusa.<br />
Dificultad: Nueve.<br />
Estrategia: Karkinos, el rey cangrejo y quinto monstruo del mar, es m&aacute;s dif&iacute;cil que cualquier cosa a la que te hayas enfrentado hasta ahora. Aseg&uacute;rate tener muchas monedas en mano.</p>

<p>Primero, te intentar&aacute; machacar con una de sus pinzas. Para evitar esto, debes mantener un flujo constante de disparos en su pinza gigante, su sunburst area. Es bastante dif&iacute;cil mantener tus proyectiles dirigidos a su pinza, as&iacute; que podr&iacute;as perfectamente recibir algo de da&ntilde;o. Eventualmente, retirar&aacute; la pinza y el patr&oacute;n empezar&aacute; de nuevo.</p>

<p>Despu&eacute;s de varios ciclos, la dificultad subir&aacute; a otro nivel. Ahora Karkinos te atrapa contra el suelo del oc&eacute;ano. Dentro de un l&iacute;mite de tiempo muy corto, debes dispararle a tres de sus piernas. Empieza con la de abajo, luego con la del medio y luego la de arriba. Tienes que hacer esto en menos de 5 segundos. Ahora, tienes que pegarle un tiro en ambos ojos. S&iacute;, Karkinos tiene dos sweer spots, y si su no puedes darle a los dos dentro de un periodo muy corto, recibir&aacute;s da&ntilde;o. Despu&eacute;s de golpearle en ambos ojos, tienes que darle otra vez en ambos dos veces m&aacute;s. De nuevo, esto es muy dif&iacute;cil porque sus ojos son muy peque&ntilde;os. Pero si puedes hacerlo, has barrido el North Sea.</p>

<p>
Stage Seis: West Ocean<br />
-------------------------------------------</p>

<p>Nombre: Basilosaurus<br />
Descripci&oacute;n: Una enorme y sinuosa criatura con aspecto de anguila, con un par de piernas traseras. Esta es casi exactamente la forma de un Basilosaurio real.<br />
Criaturas aliadas: Ninguna.<br />
Te lo encuentras: Cuando llevas nadando por ah&iacute; un par de minutos.<br />
Dificultad: Tres.<br />
Estrategia: Esta es realmente una batalla f&aacute;cil, especialmente para esta parte del juego. Como con Nada, se te recomienda &quot;Shoot shoot shoot!&quot;. Simplemente vac&iacute;a el cargador muchas veces, preferentemente en su boca; su sunburst area. Quiz&aacute;s te alcance una vez, por lo cual est&aacute; catalogado como un poco m&aacute;s dif&iacute;cil que Naga.</p>

<p>THE SeisTH SEA MONSTER<br />
Nombre: Midgardsorm<br />
Descripci&oacute;n: Una serpiente monstruosamente grande.<br />
Criaturas aliadas: Una especie de par&aacute;sitos cicl&oacute;peos peque&ntilde;os tipo trilobites.<br />
Te lo encuentras: Cuando llevas explorando su interior un rato.<br />
Dificultad: Cinco.<br />
Estrategia: Inmediatamente despu&eacute;s de matar a Basilosaurus, eres tragado por Midgardsorm. Despues de un rato, encontrar&aacute;s el coraz&oacute;n de la criatura, su sunburst area y &uacute;nico punto d&eacute;bil. Empieza a dispararle sin parar. Cuando lo haces, esas extra&ntilde;as criaturas con un solo ojo vendr&aacute;n hacia t&iacute;. Cada uno elegir&aacute; un punto de la br&uacute;jula (Norte, Noreste, Este, etc.) y se quedar&aacute; ah&iacute;. Tienes un segundo o dos para dispararle antes de que inflijan da&ntilde;o en t&iacute;. Haz de ellos tu primera prioridad.</p>

<p>Mientras va bajando la salud de Midgardsorm, en tres ocasiones su coraz&oacute;n se convertir&aacute; en un sweet spot. Disp&aacute;rale en esas ocasiones y perder&aacute; grandes cantidades de salud, y al tercer acierto, habr&aacute;s terminado de limpiar el West Ocean.</p>

<p>
Stage Seven: Panthalassa, The Sea Of Evil<br />
-------------------------------------------</p>

<p>Antes de empezar a describir esta fase, tengo que hacer una anotaci&oacute;n:</p>

<p>A) No hay enemigos ordinarios en esta fase, simplemente eres lanzado de batalla contra jefe a batalla contra jefe, casi como una prueba de resistencia.</p>

<p>Nombre: Kerberos<br />
Descripci&oacute;n: Tres grandes tiburones, pero no tan grandes como White Death. Como la(s) hydra(s), es desconocido si son tres individuos distntos, o est&aacute;n controlados por una &uacute;nica inteligencia.</p>

<p>Criaturas aliadas: Ninguna.<br />
Te lo encuentras: Al empezar el nivel.<br />
Dificultad: Seis.<br />
Estrategia: Tienes que ir evit&aacute;ndolos uno por uno. Cuando uno se acerque, disp&aacute;rale en el morro, es su sunburst area. Sigue dispar&aacute;ndole hasta que se marche. Luego ser&aacute;s enfilado inmediatamente otro Kerberos. Sigue repitiendo este patr&oacute;n. Puede ser dif&iacute;cil, porque ellos se mueven bastante r&aacute;pido. Afortunadamente, cada uno tiene una barra de vida separada, como las hydras, y cuando vas mat&aacute;ndolos, las cosas se ponen m&aacute;s f&aacute;ciles. </p>

<p>Nombre: Umi-Bozu<br />
Descripci&oacute;n: Un pulpo bastante m&aacute;s grande de lo normal.<br />
Criaturas aliadas: Ninguna.<br />
Te lo encuentras: Al batir a Kerberos.<br />
Dificultad: Cinco.<br />
Estrategia: Este jefe juega como una versi&oacute;n m&aacute;s astuta de Scylla. Te levantar&aacute; un tent&aacute;culo para atacarte, y como tambi&eacute;n es su sunburst area, debes dispararle para mantenerte a salvo. &iexcl;Pero cuidado! A &eacute;l le encanta enga&ntilde;arte levantando un tent&aacute;culo y luego r&aacute;pidamente intent&aacute;ndote atacar con otro. As&iacute; que mant&eacute;n la guardia y est&aacute;te listo para desplazar tu punter&iacute;a al primer indicio.</p>

<p>Al poco, Umi-Bozu empezar&aacute; a nadar rode&aacute;ndote y puedes empezar a dispararle un poco al azar. Sin embargo, &eacute;l se har&aacute; invisible por un breve periodo, una t&aacute;ctica que me ha hecho ponerle el apodo &quot;Calamar invisible&quot; (incluso siendo un pulpo). Sin embargo, pese a ser invisible puede recibir da&ntilde;o, si le das.</p>

<p>Pronto, empezar&aacute; a cargar hacia t&iacute; como Scylla. Ese es su fallo. Su cabeza redonda es un blanco mucho m&aacute;s f&aacute;cil que la de Scylla, as&iacute; que deber&iacute;as ser capaz de darle las veces suficientes para vencerle antes de que te toque.</p>

<p>Nombre: Black Dragon<br />
Descripci&oacute;n: Un drag&oacute;n de Komodo o iguana marina, este es negro. <br />
Criaturas aliadas: Ninguna.<br />
Te lo encuentras: Al vencer a Umi-Bozu y explorar algunas ruinas.<br />
Dificultad: Dos.<br />
Estrategia: Esto es esencialmente pr&aacute;ctica de tiro. Como su precursor, Sea Dragon, Black Dragon nunca me ha hecho da&ntilde;o. Simplemente disp&aacute;rale, particularmente en su sunburst area, la cabeza. Le he puesto un nivel de dificultad mayor porque se mueve un poco m&aacute;s r&aacute;pido y te&oacute;ricamente podr&iacute;a hacerte da&ntilde;o.</p>

<p>Nombre: Vritra &amp; Kaliya<br />
Descripci&oacute;n: Dos enormes peces remo, pero no tan grandes como Naga. Vritra es azul el&eacute;ctrico, mientras que Kaliya es amarillo/dorado como la percepci&oacute;n humana de la corriente el&eacute;ctrica.<br />
Te lo encuentras: Cuando vences a Black Dragon.<br />
Dificultad: ten.<br />
Estrategia: Prep&aacute;rate para sufrir.</p>

<p>Vritra &amp; Kaliya te quitar&aacute;n bastantes monedas del bolsillo. Son extremadamente dif&iacute;ciles, y vencerlos es tanto suerte como habilidad. Son r&aacute;pidos como el rayo y tan delgados que pueden ser dif&iacute;ciles de acertar.<br />
Cada uno tiene su sunburst area en su barbilla, pero es a&uacute;n m&aacute;s dif&iacute;cil de alcanzar. El &uacute;nico elemento de la pelea que juega a tu favor es que tienen dos barras de vida separadas.</p>

<p>Elige a uno, Vritra o Kaliya, no importa. No quites las manos del gatillo nunca durante esta pelea. Sigue a tu serpiente de mar elegida tan bien como puedas, atacando al otro solo cuando es obvio que un ataque viene en camino.</p>

<p>Cuando Vritra (o Kaliya), las cosas se ponen un poco m&aacute;s f&aacute;ciles, pero no demasiado. Obviamente, concentra tus disparos en el que quede vivo. Cuando ambos hayan ca&iacute;do, date una palmadita en la espalda; lo has conseguido.</p>

<p>THE SEVENTH SEA MONSTER</p>

<p>The final boss of the game has Tres separate forms, each of which I discuss<br />
separately.</p>

<p>El jefe final del juego tiene tres formas separadas, cada una de las cuales se describir&aacute; separadamente.</p>

<p>Nombre: Dagon<br />
Descripci&oacute;n: Un humanoide alto, cuya piel parece de piedra azul.<br />
Te lo encuentras: Al defender Vritra &amp; Kaliya y entrar al templo.<br />
Dificultad: Seis.<br />
Estrategia: De las tres batallas que tendr&aacute;s con el monstruo marino final y autor de todo el caos, la primera es de largo la m&aacute;s f&aacute;cil. Disp&aacute;rale continuamente y cuando te intente pegar, disp&aacute;rale a las palmas de sus manos. No solo conseguir&aacute;s estar a salvo, sino que como son sus sunburst areas, su salud bajar&aacute; r&aacute;pidamente. Cuando la mayor&iacute;a de su salud haya sido mermada, saltar&aacute; al techo un momento, luego bajar&aacute; e intentar&aacute; pegarte. Debes mantener el fuego en sus manos todo el tiempo. &Eacute;l nunca parar&aacute; el golpe, as&iacute; que lo que debes hacer es concentrarte en un continuo y firme flujo de disparos hacia su mano para mantenerla lejos de t&iacute; lo m&aacute;ximo que puedas. Si tienes la suficiente suerte y rapidez en el gatillo, ser&aacute;s capaz de acabar con la poca vida que le queda antes de que te toque. Dagon no tiene sweet spot. </p>

<p>Nombre: Poseidon<br />
Descripci&oacute;n: Un humanoide alto, cuya piel parece de piedra azul y de orejas puntiagudas.<br />
Te lo encuentras: Al vencer a Dagon.<br />
Dificultad: Nueve.<br />
Estrategia: Esta forma es bastante m&aacute;s dif&iacute;cil. Su primer ataque es lanzarte esferas de energ&iacute;a, las cuales afortunadamente puedes parar con disparos, &eacute;l las crea muy deprisa, as&iacute; que pueden abrumarte. Simplemente sigue disparando a Poseidon y wear him down. No tiene sunburst area.</p>

<p>Cuando su salud es baja, coger&aacute; un tridente oxidado, y ahora la batalla se convierte en algo un poco rid&iacute;culo. Su sweet spot es su codo derecho, y debes dispararle ah&iacute; antes de que te pueda ensartar en el tridente. No solo tienes un tiempo muy limitado para hacerlo, y no solo es un spot muy peque&ntilde;o que debas<br />
golpear, sino que esta tan cerca de la parte de abajo de la pantalla que puede ser dif&iacute;cil siquiera apuntar en esa direcci&oacute;n. Casi puedo garantizar que te dar&aacute; una o dos veces antes de que le puedas dar. Da igual, persevera y le dar&aacute;s las tres veces necesarias en el codo.</p>

<p>Nombre: Rahab<br />
Descripci&oacute;n: un humanoide alto cuyas piernas se han fusionado en una cola gigante, con ** por la espalda y garras muy afiladas. Sus ojos cambian de azul a rojo, e incluso le crece un tercero. <br />
Te lo encuentras: Al vencer a Poseidon.<br />
Dificultad: ten.<br />
Estrategia: &iexcl;Eso es! todo lo que queda entre t&uacute; y hacer los oc&eacute;anos un lugar seguro es una batalla final contra Rahab, quien caus&oacute; todo este desbarajuste. Una batalla final...y es &uacute;nica.</p>

<p>Rahab es incre&iacute;blemente r&aacute;pido, el m&aacute;s r&aacute;pido del juego. Puede ser muy dif&iacute;cil darle mientras nada por las ruinas del templo. Tambi&eacute;n, cuando &eacute;l repite el ataque de golpeo que us&oacute; en su forma de Dagon, es mucho m&aacute;s dif&iacute;cil dispararle a las manos (de nuevo su sunburst area) lo suficientemente r&aacute;pido para que no te golpee. Te intentar&aacute; morder y te morder&aacute;, movi&eacute;ndose muy r&aacute;pido. Para romper su cadena de ataques, tienes que dispararle en los dientes, pero se mueve tan r&aacute;pido que puede ser muy dif&iacute;cil de hacer.</p>

<p>Cuando su salud baje, su lengua saldr&aacute; de su boca y para atacarte y agarrarte; su sweet spot se revelar&aacute; por s&iacute; mismo, su tercer ojo. Sin embargo, como t&uacute; y &eacute;l ahora se mueven de manera &quot;libre&quot;, puede ser absurdamente dif&iacute;cil darle en el ojo antes de que te haga da&ntilde;o. Primero, tienes que darle directamente en su tercer ojo cerrado. Su p&aacute;rpado se abrir&aacute;, y tendr&aacute;s que darle en el ojo de nuevo antes de que su lengua te estruje. Tienes que hacer esto tres veces seguidas. Pero ten fe, m&aacute;s tarde o m&aacute;s temprano le dar&aacute;s los necesarios tres disparos, y Rahab caer&aacute; de una vez por todas. Ahora puedes sentarte, mirar tu puntuaci&oacute;n total, ver los cr&eacute;ditos finales y escuchar a Rahab contando su historia.</p>

<p>&iexcl;Y as&iacute; acaba la aventura de los siete mares!</p>

<p>***</p>

<p>Gu&iacute;a mitol&oacute;gico/religiosa:</p>

<p>Mientras jugaba a The ocean hunter, me he dado cuenta de que la inmensa mayor&iacute;a de los jefes est&aacute;n sacados de o inspirados en figuras de mitolog&iacute;as antiguas, y unas pocas incluso de la propia Cristiandad. Me he dado cuenta de que la mayor&iacute;a de los jugadores no reconocer&iacute;an muchos de esos nombres, as&iacute; que he decidido escribir una gu&iacute;a detallando esos hechos.</p>

<p>WHITE DEATH<br />
Proviene de la mitolog&iacute;a: Ninguna</p>

<p>El nombre white death no proviene de ninguna mitolog&iacute;a. Se ha cogido de nuestro miedo colectivo a los tiburones. &quot;White death&quot; ha sido otro nombre para el tibur&oacute;n blanco.</p>

<p>SEA DRAGON<br />
Proviene de la mitolog&iacute;a: muchas</p>

<p>Muchas culturas mencionan criaturas con aspecto de drag&oacute;n bajo el oc&eacute;ano en sus creencias. La mayor&iacute;a de las veces son orientales, como la China o la Japonesa. Sin embargo, la criatura de este juego recuerda una gran iguana marina.</p>

<p>SEA SERPENT<br />
Proviene de la mitolog&iacute;a: muchas</p>

<p>Hay muy pocas criaturas del mito (o criptozoolog&iacute;a) m&aacute;s comunes que la Sea Serpent. Los marineros de todo el mundo, incluso a d&iacute;a de hoy, informan de avistamientos de bestias reptilianas gigantes oce&aacute;nicas. Sin embargo, la Sea Serpent del juego es simplemente una serpiente gigante. Parece ser una forma de la serpiente Californiana conocida como &quot;la aberrante&quot;. Excepto por su tama&ntilde;o y porque vive en el agua.</p>

<p>KRAKEN<br />
Proviene de la mitolog&iacute;a: Norse</p>

<p>The Kraken was an enormous giant octopus or squid, often seen off the<br />
coasts of Norway. In 1752, Bishop Erik Ludvigsen Pontoppidan described<br />
the Kraken in his book &quot;The Natural History of Norway&quot; as a mile and a<br />
half across, with arms so huge &quot;if they were to lay hold of the largest<br />
man-of-war, they would pull it down to the bottom.&quot; The Kraken may in<br />
fact NOT be a myth, but be an exaggeration of the giant squid, colossal<br />
octopus, or the most mysterious of all, the colossal squid, which is<br />
believed to reach lengths of up to 40 feet long.</p>

<p>HYDRA<br />
Proviene de la mitolog&iacute;a: Greek</p>

<p>Living in a swamp near the ancient Greek city of Lerna, the Hydra had<br />
multiple heads (usually reported at Nueve) that it used to devour<br />
livestock and villagers. Heracles (aka Hercules) had to slay the Hydra,<br />
Uno of several monster children of Typhon and Echidna,as Uno of his<br />
labors. However, he soon learned that cutting off a head resulted in<br />
Dos new Unos growing in its place. He got his nephew Iolausto fetch<br />
him torches, so everytime he cut off a head he was able tocauterize the<br />
wound, stopping new heads from growing. The final head was immortal,<br />
and not even he could kill it. So he ripped it off the Hydra's body<br />
and buried it under a giant boulder, trapped for eternity. Because<br />
of Iolaus's help, the goddess Hera would rule that this labor did not<br />
&quot;count.&quot; We shall return to this story later.</p>

<p>LEVIATHAN<br />
Proviene de la mitolog&iacute;a: Judeo-Christian</p>

<p>In the Old Testament, the Leviathan was a &quot;chaos animal&quot; in the form of a<br />
crocodile, serpent, whale, or shark. It later would come to be viewed<br />
as an &quot;anti-divine&quot; symbol of evil that would be killed on the final<br />
Judgement Day. The Leviathan, viewed as huge and unstoppable, also<br />
figures into the mythologies of Canaan and Ugarit, Dos Middle-Eastern<br />
city-states.</p>

<p>SCYLLA<br />
Proviene de la mitolog&iacute;a: Greek</p>

<p>Scylla was a beautiful nymph, who spurned the advances of minor sea god<br />
Glaucus. As Glaucus poured out his heart to the sorceress Circe, she<br />
herself became enamored of him, but he would not accept her as long as<br />
there was Scylla. Circe decided to eliminate the competition, using a<br />
powerful potion to poison Scylla's bathing pool. The next time she<br />
bathed, &quot;from the lower half of her body Scylla grew Seis monstrous dogs,<br />
but the upper half remained intact.&quot; Horrified and loathing the world,<br />
Scylla became a menace to any sailor that passed nearby. The great<br />
Greek hero Odysseus once had to let Scylla kill Seis of his men so that<br />
the rest would all be saved from the even greater menace that lurked<br />
nearby (see below).</p>

<p>NAGA<br />
Proviene de la mitolog&iacute;a: Hindu</p>

<p>Nagas are a race of serpent-people, half human, half snake. Worshipped<br />
to this day as fertility symbols, they live in palaces in the underground<br />
city Bhogavati. Protecting springs, wells, and rivers, Nagas can be both<br />
beneficial, bringing rain, or malicious, bringing floods or drought.<br />
Ruled by Sesha, others include Ananta, Vasuki, Manasa, and Mucilinda.</p>

<p>CHARYBDIS<br />
Proviene de la mitolog&iacute;a: Greek</p>

<p>Charybdis was a wicked daughter of the sea god Poseidon. After eating<br />
some of Heracles's cattle, Zeus transformed her into a monster, forced<br />
to constantly suck in and spit out huge quantities of water. Living<br />
right next to Scylla, she could devour entire boats, which is why<br />
Odysseus was forced to steer closer to Scylla and let her eat Seis<br />
of his men.</p>

<p>AHUIZOTL<br />
Proviene de la mitolog&iacute;a: Aztec</p>

<p>The Ahuizotl is an amphibious creature that resembles a cross between<br />
a human and a monkey, using a hand on the end of its tail to snatch<br />
unfortunates who wander too close to the water. Sometimes it cries<br />
like a child to attract well-meaning people who only want to help,<br />
but they soon become prey.</p>

<p>MEDUSA<br />
Proviene de la mitolog&iacute;a: Greek</p>

<p>Uno of the Tres Gorgons, she slept with Poseidon in a temple to the<br />
goddess Athena. In revenge, Athena turned her into a monster with<br />
snakes for hair and whose gaze could turn people to stUno. She was<br />
killed by the hero Perseus. He gave her head to Athena; from her<br />
blood was born the Pegasus as well as a giant called Chrysaor.</p>

<p>KARKINOS<br />
Proviene de la mitolog&iacute;a: Greek</p>

<p>During Heracles's fight against the Hydra, Hera, outraged that Iolaus<br />
was helping him, decided to give the Hydra some backup. She sent a<br />
giant crab Nombred Karkinos to attack them as well. However, Heracles<br />
was able to crush it under his foot.</p>

<p>BASILOSAURUS<br />
Proviene de la mitolog&iacute;a: Ninguna</p>

<p>This is a real creature that lived in the period known as the late<br />
Eocene, approximately 30 million years ago. Distantly related to<br />
modern-day whales, this predatorymammal could grow up to 80 feet<br />
long and for a time was probably the largest creature in the<br />
world. It retained vestigal hind legs, which its own ancestors<br />
had used on land.</p>

<p>MIDGARDSORM<br />
Proviene de la mitolog&iacute;a: Norse</p>

<p>This monstrous serpent was Uno of Tres children of the trickster<br />
god Loki and his giantess wife Angrboda. The king of the gods,<br />
Odin, cast it into the ocean, but it was so large it encircled<br />
the entire world and took its own tail in its mouth.<br />
Midgardsorm is Norse for &quot;Midgard Serpent,&quot; Midgard being their<br />
word for Earth, and is but a title. Its true Nombre is Jormungand.<br />
During Ragnarok, the Twilight of the Gods, it will engage Thor,<br />
god of thunder, in an epic battle to the death. Thor will slay<br />
it, take Nueve steps, and then die himself from its poison.</p>

<p>KERBEROS<br />
Proviene de la mitolog&iacute;a: Greek</p>

<p>More commonly known as Cerberus, Kerberos was the Tres-headed<br />
watchdog that guarded the entrance to Tartarus, realm of the<br />
dead. Uno of the monstrous offspring of Typhon and Echidna,<br />
only a few living beings were ever able to sneak past it, such<br />
as the great musician Orpheus, and Heracles, who had to bring<br />
it to the living world as his final labor.</p>

<p>UMI-BOZU<br />
Proviene de la mitolog&iacute;a: Japanese</p>

<p>A &quot;giant black sea phantom,&quot; the Umi-Bozu is a bit mysterious.<br />
Some claim it to be the restless souls of priests who died<br />
at sea. It is bald with huge, terrifying eyes.</p>

<p>BLACK DRAGON<br />
Proviene de la mitolog&iacute;a: muchas</p>

<p>The Black Dragon is identical to the Sea Dragon, except a dark<br />
ebony color. It is common in stories for something that is<br />
evil and powerful to be colored and Nombred black. Indeed, in<br />
J.R.R. Tolkien's LORD OF THE RINGS universe, the greatest--and<br />
wickedest--dragon of all time was Ancalagon the Black.</p>

<p>VRITRA &amp; KALIYA<br />
Proviene de la mitolog&iacute;a: Hindu</p>

<p>Vritra was an enormous serpent, created by Tvashtri after his son<br />
Trisiras was killed by Indra, chief of the gods. Vritra gathered<br />
all the water in the world, causing a horrible drought. Despite<br />
enhancing his strength muchas times from drinking the ambrosia-like<br />
Soma, Indra was still no match for him. In the end, Indra was able<br />
to slay Vritra by seizing sea foam--which was actually Vishnu, the<br />
great preserver god--and smiting him with it.<br />
Kaliya was another great serpent. Hiding from the great bird Garuna,<br />
Kaliya fled to the Yamuna river, which it poisUnod with its breath.<br />
Krishna, the current avatar of Vishnu, engaged him in a titanic<br />
battle and danced on his head until Kaliya's wives begged for mercy.<br />
He relented and let the serpent go, who fled to Fiji.</p>

<p>DAGON<br />
Proviene de la mitolog&iacute;a: Philistine</p>

<p>Dagon was a half-man, half-fish god of crop fertility. He is Uno<br />
of the most senior of all gods, worshipped for over 2000 years. It<br />
was a temple to Dagon that Samson brought down during his death.</p>

<p>POSEIDON<br />
Proviene de la mitolog&iacute;a: Greek</p>

<p>Poseidon was Uno of the most powerful of the Greek gods. Lord of<br />
the sea, he is a very moody god, capable of great wrath. He once<br />
hounded Odysseus for more than ten years. He rode dolphins and<br />
used tridents as his favored weapon.</p>

<p>RAHAB<br />
Proviene de la mitolog&iacute;a: Judeo-Christian</p>

<p>A &quot;serpent of chaos,&quot; that also symbolizes the chaos banished by God<br />
during Creation. It is a powerful dragon demon, and is also known<br />
to the Philistines as Tiamat, the multi-headed dragon god.</p>

<p>***</p>

<p>WHAT'S TO COME</p>

<p>Here's what I plan on adding in the future:</p>

<p>A) Any strategies or tips that you, my readers, send in.<br />
B) Any &quot;hidden bosses&quot; that perhaps I've always missed but someUno else has<br />
found.<br />
C) Where the sea and ocean Nombres come from.</p>

<p>***</p>

<p>READER SUBMITTED INFORMATION AND TIPS</p>

<p>Here are some tips from Forgotten Trainer Jack:</p>

<p>&quot;Most bosses have a &quot;extra&quot; weak spot you call &quot;sunbrust area&quot; and that is<br />
their eyes... Boss like Leviathan, Scylla, Charybdis... try it... it<br />
works...Also, which i think you SHOULD already knew, the bullets take a<br />
1full sec to reload every 6 shots and the bullets NEVER goes straight...<br />
my advice is that during the &quot;sweet shot&quot; aim, save &amp; use the bullets<br />
wisely and try to estimate where the bullets goes (it isn't that hard)...<br />
If you're aim some (eg, saving ppl from fish), use Uno trigger instead of<br />
both... this way it avoid shotting extra bullets which may accidentaly<br />
kill someUno...Also, during &quot;sweet shot&quot; at boss, the key is timing...<br />
Kraken swings you left and right while shotting, Leviathan takes while to<br />
open his big mouth, Ahuizotl takes 1/2 a sec shorter than Leviathan to<br />
rise it's head...To hit Charybdis' blub, start you're aim 1or 2 inch<br />
below and bout 1 inch to the right of the blub, if did correctly, you'll<br />
lock him in a stun mode and kill him with ease...For Karkinos's eyes,<br />
instead of shotting direactly at the eyes, aim below the target...<br />
you bullets will &quot;float&quot; up and hit his eyes...&quot;</p>

<p>
***</p>

<p>RECOGNITION</p>

<p>Thanks to Sega for making such a great game, to Walt Disney World for<br />
introducing me to it, and to Frankie's Fun Park for letting me defeat it.</p>

<p>Also thanks to Forgotten Trainer Jack for sending some tips.</p>

<p>Thanks to these sites for the Mythological Guide info:</p>

<p>&quot;Zodiac Relationships With Mythology&quot;<br />
http://www.osage.net/~lwaite/zodiac.html</p>

<p>&quot;Ahuizotl&quot;<br />
http://webhome.idirect.com/~donlong/monsters/Html/Ahuizotl.htm</p>

<p>&quot;Notebook&quot;<br />
http://www.noteaccess.com/APPROACHES/AGW/Charybdis.htm</p>

<p>&quot;Encyclopedia Mythica&quot;<br />
http://www.pantheon.org/main/search.html</p>

<p>&quot;Californian Kingsnake Colour &amp; Pattern Morphs&quot;<br />
http://www.reptimania.co.uk/calimorphs.htm</p>

<p>&quot;The Kraken&quot;<br />
unmuseum.mus.pa.us/kraken.htm</p>

<p>&quot;Rare Colossal Squid Found In Antarctica&quot;<br />
dsc.discovery.com/news/briefs/20030331/squid.html</p>

<p>&quot;Basilosaurus&quot;<br />
http://www.kenozoicum.nl/website%20mega%20predators/basilosaurus.html</p>

<p>&quot;Folklure&quot;<br />
http://thelegacy.20m.com/library/folklore.htm</p>

<p>&quot;Death: Ghosts&quot;<br />
http://library.thinkquest.org/16665/ghosts.htm</p>

<p>&quot;Umi-Bozu&quot;<br />
mywebpages.comcast.net/scottandrewh/umi_bozu.html</p>

<p>&quot;Galapagos Marine Iguana&quot;<br />
http://www.rit.edu/~rhrsbi/GalapagosPages/MarineIguana.html</p>

<p>&quot;Encyclopedia Of Arda: Ancalagon&quot;<br />
http://www.glyphweb.com/arda/a/ancalagon.html</p>

<p>&quot;Krishna And Kaliya&quot;<br />
http://www.exoticindia.com/product/ZI72</p>

<p>&quot;Krishna Killing Kaliya&quot;<br />
krishna.org/sudarsana/archive/msg00329.html</p>

<p>&quot;Christian-Forum.net - Satan and Rahab&quot;<br />
http://www.christian-forum.net/index.php?showtopic=122</p>

<p></p>
